class WetherCodeConverter:
    @staticmethod
    def convert(code: int) -> str:
        weather_code_map: dict[int, str] = {
            0: "快晴",
            1: "晴れ時々くもり",
            2: "晴れ時々くもり",
            3: "曇り",
            45: "霧",
            48: "霧（着氷性の霧）",
            51: "霧雨（弱い）",
            53: "霧雨（やや強い）",
            55: "霧雨（強い）",
            56: "着氷性の霧雨（弱い）",
            57: "着氷性の霧雨（強い）",
            61: "雨（弱い）",
            63: "雨（やや強い）",
            65: "雨（強い）",
            66: "着氷性の雨（弱い）",
            67: "着氷性の雨（強い）",
            71: "雪（弱い）",
            73: "雪（やや強い）",
            75: "雪（強い）",
            77: "細かい雪",
            80: "にわか雨（弱い）",
            81: "にわか雨（やや強い）",
            82: "にわか雨（激しい）",
            85: "にわか雪（弱い）",
            86: "にわか雪（強い）",
            95: "雷雨",
            96: "ひょうを伴う雷雨（弱い）",
            99: "ひょうを伴う雷雨（強い）",
        }

        return weather_code_map.get(code, f"不明な天気コード: {code}")
